(function () {

    var cate1Conf = {1: "水", 2: "电", 3: "木", 4: "瓦", 5: "油", 6: "工具", 99: "虚拟物品"};
    var cate2Conf = {
        1:{101:"PPR水管",110:"PPR配件",102:"PVC下水管",111:"PVC配件",106:"PB管件",108:"工具配件",112:"套餐"},
        2:{201:"电线",204:"PVC线管",214:"线管配件",202:"弱电",203:"护套线",212:"配电箱",206:"线槽桥架",205:"JDG管件",208:"穿线软管",213:"工具配件",216:"套餐"},
        3:{302:"石膏板",303:"轻钢龙骨",305:"吊顶配件",301:"板材",304:"木龙骨",309:"钉类",308:"胶类",307:"保温材料",310:"工具配件",311:"套餐"},
        4:{401:"防水材料",403:"沙石水泥",404:"砖类",402:"瓷砖配件",407:"铁丝网",405:"拉渣土",406:"工具配件",409:"套餐"},
        5:{501:"墙锢",502:"腻子石膏",508:"石膏线",507:"快粘粉",505:"油漆涂料",511:"胶类",510:"工具配件",512:"套餐"},        6: {108: "水工工具", 213: "电工工具", 310: "木工工具", 406: "瓦工工具", 510: "油工工具", 602: "五金工具", 601: "其他工具"},
        99: {999: "虚拟物品"}
    };
    var cate3Conf = {
        110: {11001: "直接", 11002: "弯头", 11003: "三通", 11004: "其他配件"},
        111: {11101: "直接", 11102: "弯头", 11103: "三通", 11104: "其他配件"},
        214: {21401: "线管直接", 21402: "线管螺接", 21403: "接线盒", 21404: "其他线管配件"}
        //101: {10101: "PPR水管", 10102: "直接", 10103: "弯头", 10107: "三通", 10104: "水管卡", 10105: "堵帽&堵丝", 10106: "生料带&麻丝"},
        //102: {10201: "PVC下水管", 10202: "直接", 10203: "弯头", 10205: "三通", 10104: "水管卡", 10206: "堵帽", 10207: "胶"},
        //103: {10301: "镀锌管", 10302: "直接", 10303: "弯头", 10307: "三通", 10305: "堵帽&堵丝", 10308: "补芯", 10309: "对丝", 10310: "活接", 10306: "套丝服务"},
        //105: {10502: "PPR活接接球阀", 10503: "截止阀", 10504: "八字阀", 10505: "球阀", 10506: "热水器接头", 10507: "冷水表"},
        //108: {10801: "热熔机", 10802: "管钳", 10804: "打压机", 10805: "生料带", 10806: "水龙头", 10807: "地漏"},
        //202: {20201: "电视线&相关", 20202: "电话线&相关", 20203: "网络线&相关", 20204: "音响线&相关", 20205: "视频线&相关"},
        //203: {20301: "两芯护套线", 20302: "三芯护套线"},
        //204: {20401: "PVC线管", 20402: "接头", 20403: "弹簧", 20404: "明盒&暗盒", 20405: "线管卡"},
        //205: {20501: "JDG线管", 20502: "接头", 20504: "弯管器", 20506: "铁盒&相关", 20508: "线管卡", 20509: "扎带", 20510: "导电膏", 20511: "石棉"},
        //206: {20601: "PVC线槽", 20602: "镀锌铁桥架"},
        //208: {20801: "防蜡管", 20802: "玻璃丝管", 20803: "包塑软管"},
        //212: {21201: "配电箱", 21202: "空开", 21203: "漏电", 21204: "插座", 21205: "临时用电箱", 21207: "配电箱轨道", 21209: "时控开关"},
        //301: {30101: "大芯板", 30102: "九厘板", 30103: "五厘板", 30104: "三厘板", 30105: "桑拿板", 30106: "集成板", 30107: "铝塑板", 30108: "生态板", 30109: "免漆板", 30110: "竹胶板", 30111: "清水模板"},
        //305: {30501: "主骨类", 30502: "50付骨", 30503: "边角", 30504: "格栅", 30505: "烤漆龙骨", 30506: "硅钙板", 30507: "矿棉吸音板", 30508: "铝扣板", 30509: "塑钢板", 30510: "PVC板"},
        //306: {30601: "主大吊", 30602: "螺母", 30603: "抓钩", 30604: "通丝", 30605: "拉爆", 30606: "通丝接头", 30607: "50付接"},
        //307: {30701: "外墙网格布", 30702: "铝箔胶带", 30703: "橡塑板", 30704: "保温钉", 30705: "挤塑板", 30706: "玻璃棉"},
        //308: {30801: "玻璃胶", 30802: "万能胶", 30803: "白乳胶", 30804: "发泡胶", 30805: "橡塑胶", 30806: "美巢占木宝"},
        //503: {50301: "内墙耐水腻子", 50302: "外墙耐水腻子"},
        //504: {50401: "底层石膏", 50402: "嵌缝石膏", 50403: "高强石膏"},
        //509: {50901: "牛皮纸", 50902: "网格布", 50903: "网格带", 50904: "美纹纸", 50905: "贴墙白布"},
        //510: {51001: "刷子", 51002: "滚筒", 51003: "油工刀", 51004: "油工抹子", 51005: "伸缩把", 51006: "砂布", 51007: "小桶", 51008: "砂纸架", 51009: "油工排笔"}
    };

    function main() {
        _initList();
        $('select[name=cate1]').change(_onChgCate1);
        $('select[name=cate2]').change(_onChgCate2);
    }

    function _initList() {
        var cate1 = jQuery('select[name=cate1]'),
            cate2 = jQuery('select[name=cate2]'),
            cate3 = jQuery('select[name=cate3]'),
            initCate1 = cate1.data('init'),
            initCate2 = cate2.data('init'),
            initCate3 = cate3.data('init');

        // 城区
        cate1.html('');
        cate1.append("<option value=''>--选择大类--</option>");
        for (var id1 in cate1Conf) {
            if (initCate1 && initCate1 == id1) {
                cate1.append(jQuery("<option selected='selected'></option>").val(id1).html(cate1Conf[id1]));
            } else {
                cate1.append(jQuery("<option></option>").val(id1).html(cate1Conf[id1]));
            }
        }

        // 小类
        if (initCate1) {
            _onChgCate1(initCate2);
        } else {
            cate2.html('').append("<option value=''>--选择小类--</option>");
        }

        // 细类
        if (initCate1 && initCate2) {
            _onChgCate2(initCate3);
        } else {
            cate3.hide();
        }
    }

    function _onChgCate1(preSelectCate2) {
        var cate1 = jQuery('select[name=cate1]'),
            cate2 = jQuery('select[name=cate2]'),
            id1 = cate1.val(),
            cate2List = id1 > 0 ? cate2Conf[id1] : [];

        cate2.html('');
        cate2.append("<option value=''>--选择小类--</option>");
        for (var id2 in cate2List) {
            if (preSelectCate2 && preSelectCate2 == id2) {
                cate2.append(jQuery("<option selected='selected'></option>").val(id2).html(cate2List[id2]));
            } else {
                cate2.append(jQuery("<option></option>").val(id2).html(cate2List[id2]));
            }
        }
    }

    function _onChgCate2(preSelectCate3) {
        var cate1 = jQuery('select[name=cate1]'),
            cate2 = jQuery('select[name=cate2]'),
            cate3 = jQuery('select[name=cate3]'),
            id2 = cate2.val(),
            cate3List = id2 > 0 && cate3Conf[id2] ? cate3Conf[id2] : {};

        if (K.isEmpty(cate3List)) {
            cate3.hide();
        }
        else {
            cate3.html('');
            cate3.append("<option value=''>--选择细类--</option>");
            for (var id3 in cate3List) {
                if (preSelectCate3 && preSelectCate3 == id3) {
                    cate3.append(jQuery("<option selected='selected'></option>").val(id3).html(cate3List[id3]));
                } else {
                    cate3.append(jQuery("<option></option>").val(id3).html(cate3List[id3]));
                }
            }
            cate3.show();
        }
    }

    main();

})();