<?php
/**
 * 地点配置
 */
class Conf_Area
{
    const Separator_Construction = '###';
    
    public static $CITY = array(
        Conf_City::BEIJING => '北京',
    );

    public static $DISTRICT = array(
        Conf_City::BEIJING => array(
            1001 => '东城区',
            1002 => '西城区',
            1003 => '石景山区',
            1004 => '朝阳区',
            1005 => '丰台区',
            1006 => '海淀区',
            1007 => '门头沟区',
            1008 => '房山区',
            1009 => '通州区',
            1010 => '顺义区',
            1011 => '昌平区',
            1012 => '大兴区',
            1013 => '怀柔区',
            1014 => '平谷区',
            1015 => '密云县',
            1016 => '延庆县',
        )
    );
    //0-未知;
    //北京: 1 => '二环以内', 2 => '二至三环', 3 => '三至四环', 4 => '四至五环', 5 => '五至六环', 6 => '六环以外',
    //天津: 1-外环以里; 2-外环以外
    //武汉: 1 => '二环以内', 2 => '二至三环', 3 => '三至四环', 4 => '四环外',
    public static $AREA = array(
        1001 => array(1 => '二环以内', 2 => '二至三环'), // 东城区
        1002 => array(1 => '二环以内', 2 => '二至三环'), // 西城区
        1003 => array(4 => '四至五环', 5 => '五至六环', 6 => '六环以外'), // 石景山区
        1004 => array(2 => '二至三环', 3 => '三至四环', 4 => '四至五环', 5 => '五至六环'), // 朝阳区
        1005 => array(2 => '二至三环', 3 => '三至四环', 4 => '四至五环', 5 => '五至六环', 6 => '六环以外'), // 丰台区
        1006 => array(2 => '二至三环', 3 => '三至四环', 4 => '四至五环', 5 => '五至六环', 6 => '六环以外'), // 海淀区
        1007 => array(5 => '五至六环', 6 => '六环以外'), // 门头沟区
        1008 => array(5 => '五至六环', 6 => '六环以外'), // 房山区
        1009 => array(5 => '五至六环', 6 => '六环以外'), // 通州区
        1010 => array(5 => '五至六环', 6 => '六环以外'), // 顺义区
        1011 => array(5 => '五至六环', 6 => '六环以外'), // 昌平区
        1012 => array(4 => '四至五环', 5 => '五至六环', 6 => '六环以外'), // 大兴区
        1013 => array(6 => '六环以外'), // 怀柔区
        1014 => array(6 => '六环以外'), // 平谷区
        1015 => array(6 => '六环以外'), // 密云县
        1016 => array(6 => '六环以外'), // 延庆县
        2001 => array(6 => '六环以外'), //大厂
        2002 => array(6 => '六环以外'), //香河
        2003 => array(6 => '六环以外'), //燕郊
        2013 => array(6 => '六环以外'), //三河
        2004 => array(6 => '六环以外'), //固安
        2005 => array(6 => '六环以外'), //涿州
        2006 => array(6 => '六环以外'), //怀来
        2007 => array(6 => '六环以外'), //张家口
        2008 => array(6 => '六环以外'), //其他地区
    );

    public static $Province = array(
        '410000' => '河南省',
        '340000' => '安徽省',
        '320000' => '江苏省',
        '510000' => '四川省',
        '420000' => '湖北省',
        '370000' => '山东省',
        '330000' => '浙江省',

        '110000' => '北京市',
        '120000' => '天津市',
        '130000' => '河北省',
        '140000' => '山西省',
        '150000' => '内蒙古',
        '210000' => '辽宁省',
        '220000' => '吉林省',
        '230000' => '黑龙江省',
        '310000' => '上海市',
        '350000' => '福建省',
        '360000' => '江西省',
        '430000' => '湖南省',
        '440000' => '广东省',
        '450000' => '广西省',
        '460000' => '海南省',
        '500000' => '重庆市',
        '520000' => '贵州省',
        '530000' => '云南省',
        '540000' => '西藏省',
        '610000' => '陕西省',
        '620000' => '甘肃省',
        '630000' => '青海省',
        '640000' => '宁夏省',
        '650000' => '新疆省',
        '710000' => '台湾',
        '720000' => '香港',
        '730000' => '澳门',
        
    );
}
