<?php

/**
 * sku 配置
 */
class Conf_Sku
{
    const HAOCAI_BRAND_ID = 143;
    const MEICHAO_BRAND_ID = 129;//美巢品牌id
    const PRODUCT_SALES_SPECIAL = 1;//商品活动类型－特价
    const PRODUCT_SALES_HOT = 2;//商品活动类型－热卖
    /**
     * 砂石砖分类.
     */
    public static $SAND_CEMENT_BRICK_CATE2 = array(
        403 => 1,   //砂石类
        404 => 1,   //砖类
    );
    /**
     * 板材分类.
     */
    public static $PLATES_CATE2 = array(
        301 => 2,//板材
        302 => 2, //石膏板等
    );
    /**
     * sku类型.
     */
    const SKU_TYPE_COMMONE = 1;
    const SKU_TYPE_PROCESSED = 2;
    const SKU_TYPE_PACKAGE = 3;
    private static $SKY_TYPES = array(
        self::SKU_TYPE_COMMONE => '普通类型',
        self::SKU_TYPE_PROCESSED => '加工类型',
        self::SKU_TYPE_PACKAGE => '套餐类型',
    );
    /**
     * @var array 大类/一级分类
     */
    public static $CATE1 = array(
        1 => array('name' => '水'),
        2 => array('name' => '电'),
        3 => array('name' => '木'),
        4 => array('name' => '瓦'),
        5 => array('name' => '油'),
        6 => array('name' => '工具'),
        );
    public static $CATE1_VIRTUAL = array(
        99 => array('name' => '虚拟物品'),
        );
    /**
     * @var array 小类/二级分类
     */
    public static $CATE2 = array(
        1 => array(
            //水工材料
            101 => array('name' => 'PPR水管', 'sortby' => 99),
            110 => array('name' => 'PPR配件', 'sortby' => 98),
            102 => array('name' => 'PVC下水管', 'sortby' => 88),
            111 => array('name' => 'PVC配件', 'sortby' => 87),
            106 => array('name' => 'PB管件', 'sortby' => 66),
            108 => array('name' => '工具配件', 'sortby' => 55),
            112 => array('name' => '套餐', 'sortby' => 1),
            //103 => array('name' => '镀锌管', 'sortby' => 77),
            //104 => array('name' => '上&下水软管'),
             //107 => array('name' => '铝塑管'),
            //105 => array('name' => '阀门'),
            //109 => array('name' => '散热器', 'sortby' => 44),
        ),
        2 => array(
            //电工材料
            201 => array('name' => '电线', 'sortby' => 99),
            204 => array('name' => 'PVC线管', 'sortby' => 98),
            214 => array('name' => '线管配件', 'sortby' => 97),
            202 => array('name' => '弱电', 'sortby' => 88),
            203 => array('name' => '护套线', 'sortby' => 77),
//            215 => array('name' => '快粘粉', 'sortby' => 66),
            212 => array('name' => '配电箱', 'sortby' => 65),
            206 => array('name' => '线槽桥架', 'sortby' => 64),
            205 => array('name' => 'JDG管件', 'sortby' => 55),
            208 => array('name' => '穿线软管', 'sortby' => 33),
            213 => array('name' => '工具配件', 'sortby' => 11),
            216 => array('name' => '套餐', 'sortby' => 1),
        ),
        3 => array(
            //木工材料
            302 => array('name' => '石膏板', 'sortby' => 99),
            303 => array('name' => '轻钢龙骨', 'sortby' => 98),
            305 => array('name' => '吊顶配件', 'sortby' => 97),
            301 => array('name' => '板材', 'sortby' => 96),
            304 => array('name' => '木龙骨', 'sortby' => 88),
            309 => array('name' => '钉类', 'sortby' => 77),
            308 => array('name' => '胶类', 'sortby' => 66),
            //306 => array('name' => '吊顶配件'),
            307 => array('name' => '保温材料', 'sortby' => 44),
            310 => array('name' => '工具配件', 'sortby' => 11),
            //			311 => array('name' => '地板', 'sortby' => 40),
            //			312 => array('name' => '木工配件', 'sortby' => 8),
            311 => array('name' => '套餐', 'sortby' => 1),
        ),
        4 => array(
            //瓦工材料
            401 => array('name' => '防水材料', 'sortby' => 99),
//            408 => array('name' => '墙锢', 'sortby' => 98),
            403 => array('name' => '沙石水泥', 'sortby' => 97),
            404 => array('name' => '砖类', 'sortby' => 96),
            402 => array('name' => '瓷砖配件', 'sortby' => 88),
            407 => array('name' => '铁丝网', 'sortby' => 77),
            405 => array('name' => '拉渣土', 'sortby' => 60),
            406 => array('name' => '工具配件', 'sortby' => 44),
            409 => array('name' => '套餐', 'sortby' => 1),
        ),
        5 => array(
            //油工材料
            501 => array('name' => '墙锢', 'sortby' => 99),
            502 => array('name' => '腻子石膏', 'sortby' => 88),
            508 => array('name' => '石膏线', 'sortby' => 77),
            507 => array('name' => '快粘粉', 'sortby' => 76),
            505 => array('name' => '油漆涂料', 'sortby' => 66),
            511 => array('name' => '胶类', 'sortby' => 55),
            510 => array('name' => '工具配件', 'sortby' => 33),
            //503 => array('name' => '耐水腻子'),
            //504 => array('name' => '石膏'),
            //506 => array('name' => '油漆稀料'),
            //509 => array('name' => '墙面处理', 'sortby' => 44),
            512 => array('name' => '套餐', 'sortby' => 1),
        ),
        6 => array(
            //其他
            108 => array('name' => '水工工具', 'sortby' => 88),
            213 => array('name' => '电工工具', 'sortby' => 77),
            310 => array('name' => '木工工具', 'sortby' => 66),
            406 => array('name' => '瓦工工具', 'sortby' => 55),
            510 => array('name' => '油工工具', 'sortby' => 44),
            602 => array('name' => '五金工具', 'sortby' => 33),
            601 => array('name' => '其他工具', 'sortby' => 22),
        ),
        99 => array(
            999 => array('name' => '虚拟物品', 'sortby' => 99),
        ),
    );
    /**
     * @var array 第3级分类
     */
    public static $CATE3 = array(
        110 => array(
            11001 => array('name' => '直接', 'sortby' => 77),
            11002 => array('name' => '弯头', 'sortby' => 99),
            11003 => array('name' => '三通', 'sortby' => 88),
            11004 => array('name' => '其他配件', 'sortby' => 66),
        ),
        111 => array(
            11101 => array('name' => '直接', 'sortby' => 77),
            11102 => array('name' => '弯头', 'sortby' => 99),
            11103 => array('name' => '三通', 'sortby' => 88),
            11104 => array('name' => '其他配件', 'sortby' => 66),
        ),
        214 => array(
            21401 => array('name' => '线管直接', 'sortby' => 99),
            21402 => array('name' => '线管螺接', 'sortby' => 88),
            21403 => array('name' => '接线盒', 'sortby' => 77),
            21404 => array('name' => '其他线管配件', 'sortby' => 66),
        ),
        502 => array(
            50201 => array('name' => '易呱平', 'sortby' => 99),
            50202 => array('name' => '石膏', 'sortby' => 88),
            50203 => array('name' => '腻子', 'sortby' => 77),
            50204 => array('name' => '墙衬', 'sortby' => 66),
        ),
//        101 => array(
//            //PPR管和管件
//            10101 => array('name' => 'PPR水管'),
//            10102 => array('name' => '直接'),
//            10103 => array('name' => '弯头'),
//            10107 => array('name' => '三通'),
//            10104 => array('name' => '水管卡'),
//            10105 => array('name' => '堵帽&堵丝'),
//            10106 => array('name' => '生料带&麻丝'),
//        ),
//        102 => array(
//            //PVC管和管件
//            10201 => array('name' => 'PVC下水管'),
//            10202 => array('name' => '直接'),
//            10203 => array('name' => '弯头'),
//            10205 => array('name' => '三通'),
//            10104 => array('name' => '水管卡'),
//            10206 => array('name' => '堵帽'),
//            10207 => array('name' => '胶'),
//        ),
//        103 => array(
//            //镀锌管和管件
//            10301 => array('name' => '镀锌管'),
//            10302 => array('name' => '直接'),
//            10303 => array('name' => '弯头'),
//            10307 => array('name' => '三通'),
//            //10304 => array('name' => '水管卡'),
//            10305 => array('name' => '堵帽&堵丝'),
//            10308 => array('name' => '补芯'),
//            10309 => array('name' => '对丝'),
//            10310 => array('name' => '活接'),
//            10306 => array('name' => '套丝服务'),
//        ),
//        105 => array(
//            //阀门
//            //10501 => array('name' => '铜阀门'),
//            10502 => array('name' => 'PPR活接接球阀'),
//            10503 => array('name' => '截止阀'),
//            10504 => array('name' => '八字阀'),
//            10505 => array('name' => '球阀'),
//            10506 => array('name' => '热水器接头'),
//            10507 => array('name' => '冷水表'),
//        ),
//        108 => array(
//            //'水工工具'
//            10801 => array('name' => '热熔机'),
//            10802 => array('name' => '管钳'),
//            //10803 => array('name' => '胶'),
//            10804 => array('name' => '打压机'),
//            10805 => array('name' => '生料带'),
//            10806 => array('name' => '水龙头'),
//            10807 => array('name' => '地漏'),
//        ),
//        201 => array( //电线 红，黄，绿，蓝，白，黑
//            20101 => array('name' => '红色'),
//            20102 => array('name' => '黄色'),
//            20103 => array('name' => '绿色'),
//            20104 => array('name' => '蓝色'),
//            20105 => array('name' => '白色'),
//            20106 => array('name' => '黑色'),
//            20107 => array('name' => '双色'),
//        ),
//        202 => array(
//            //弱电
//            20201 => array('name' => '电视线&相关'),
//            20202 => array('name' => '电话线&相关'),
//            20203 => array('name' => '网络线&相关'),
//            20204 => array('name' => '音响线&相关'),
//            20205 => array('name' => '视频线&相关'),
//        ),
//        203 => array(
//            //护套线
//            20301 => array('name' => '两芯护套线'),
//            20302 => array('name' => '三芯护套线'),
//        ),
//        204 => array(
//            //PVC管和管件
//            20401 => array('name' => 'PVC线管'),
//            20402 => array('name' => '接头'),
//            20403 => array('name' => '弹簧'),
//            20404 => array('name' => '明盒&暗盒'),
//            20405 => array('name' => '线管卡'),
//        ),
//        205 => array(
//            //JDG管和管件
//            20501 => array('name' => 'JDG线管'),
//            20502 => array('name' => '接头'),
//            20504 => array('name' => '弯管器'),
//            //20505 => array('name' => '弯管器把手'),
//            20506 => array('name' => '铁盒&相关'),
//            20508 => array('name' => '线管卡'),
//            20509 => array('name' => '扎带'),
//            20510 => array('name' => '导电膏'),
//            20511 => array('name' => '石棉'),
//        ),
//        206 => array(
//            //线槽&桥架
//            20601 => array('name' => 'PVC线槽'),
//            20602 => array('name' => '镀锌铁桥架'),
//        ),
//        208 => array(
//            // '穿线软管'
//            20801 => array('name' => '防蜡管'),
//            20802 => array('name' => '玻璃丝管'),
//            20803 => array('name' => '包塑软管'),
//        ),
//        212 => array(
//            //配电箱相关
//            21201 => array('name' => '配电箱'),
//            21202 => array('name' => '空开'),
//            21203 => array('name' => '漏电'),
//            21204 => array('name' => '插座'),
//            21205 => array('name' => '临时用电箱'),
//             //21206 => array('name' => '小配电箱'),
//            21207 => array('name' => '配电箱轨道'),
//            21209 => array('name' => '时控开关'),
//            //21210 => array('name' => '石棉'),
//        ),
//        213 => array( //电工工具
//            21301 => array('name' => '胶布'),
//            21302 => array('name' => '钳'),
//            21303 => array('name' => '改锥'),
//            21304 => array('name' => '测电笔&测电插头'),
//            21305 => array('name' => '扳手'),
//            21306 => array('name' => '胀塞'),
//            21307 => array('name' => '批头'),
//            21308 => array('name' => '开孔器'),
//            21309 => array('name' => '穿线钢丝'),
//            21310 => array('name' => '插座&插头'),
//            21311 => array('name' => '用灯'),
//            21312 => array('name' => '焊锡相关'),
//        ),
//        301 => array(
//            //板材
//            30101 => array('name' => '大芯板'),
//            30102 => array('name' => '九厘板'),
//            30103 => array('name' => '五厘板'),
//            30104 => array('name' => '三厘板'),
//            30105 => array('name' => '桑拿板'),
//            30106 => array('name' => '集成板'),
//            30107 => array('name' => '铝塑板'),
//            30108 => array('name' => '生态板'),
//            30109 => array('name' => '免漆板'),
//            30110 => array('name' => '竹胶板'),
//            30111 => array('name' => '清水模板'),
//        ),
//        305 => array(
//            //吊顶材料
//            30501 => array('name' => '主骨类'),
//            30502 => array('name' => '50付骨'),
//            30503 => array('name' => '边角'),
//            30504 => array('name' => '格栅'),
//            30505 => array('name' => '烤漆龙骨'),
//            30506 => array('name' => '硅钙板'),
//            30507 => array('name' => '矿棉吸音板'),
//            30508 => array('name' => '铝扣板'),
//            30509 => array('name' => '塑钢板'),
//            30510 => array('name' => 'PVC板'),
//        ),
//        306 => array(
//            //吊顶配件
//            30601 => array('name' => '主大吊'),
//            30602 => array('name' => '螺母'),
//            30603 => array('name' => '抓钩'),
//            30604 => array('name' => '通丝'),
//            30605 => array('name' => '拉爆'),
//            30606 => array('name' => '通丝接头'),
//            30607 => array('name' => '50付接'),
//        ),
//        307 => array(
//            //保温材料
//            30701 => array('name' => '外墙网格布'),
//            30702 => array('name' => '铝箔胶带'),
//            30703 => array('name' => '橡塑板'),
//            30704 => array('name' => '保温钉'),
//            30705 => array('name' => '挤塑板'),
//            30706 => array('name' => '玻璃棉'),
//        ),
//        308 => array(
//            //胶类
//            30801 => array('name' => '玻璃胶'),
//            30802 => array('name' => '万能胶'),
//            30803 => array('name' => '白乳胶'),
//            30804 => array('name' => '发泡胶'),
//            30805 => array('name' => '橡塑胶'),
//            30806 => array('name' => '美巢占木宝'),
//        ),
//        310 => array( //木工工具
//            31001 => array('name' => '电锤'),
//            31002 => array('name' => '手枪钻'),
//            31003 => array('name' => '气泵'),
//            31004 => array('name' => '钉枪'),
//            31005 => array('name' => '钻头'),
//            31006 => array('name' => '尺子'),
//            31007 => array('name' => '锯&锯条'),
//            31008 => array('name' => '切片'),
//            31009 => array('name' => '开孔器'),
//            31010 => array('name' => '胶枪'),
//            31011 => array('name' => '线坠'),
//            31012 => array('name' => '水平仪'),
//            31013 => array('name' => '电镐'),
//            31014 => array('name' => '梯子'),
//            31015 => array('name' => '气泵'),
//        ),
//        406 => array( //瓦工工具
//            40601 => array('name' => '瓷砖推刀'),
//            40602 => array('name' => '角磨机'),
//            40603 => array('name' => '钻头'),
//            40604 => array('name' => '磨片'),
//            40605 => array('name' => '抹子'),
//            40606 => array('name' => '攒子'),
//            40607 => array('name' => '锤子'),
//            40608 => array('name' => '撬棍'),
//            40609 => array('name' => '推车'),
//            40610 => array('name' => '筛子'),
//        ),
//        503 => array(
//            //耐水腻子
//            50301 => array('name' => '内墙耐水腻子'),
//            50302 => array('name' => '外墙耐水腻子'),
//        ),
//        504 => array(
//            //'石膏'
//            50401 => array('name' => '底层石膏'),
//            50402 => array('name' => '嵌缝石膏'),
//            50403 => array('name' => '高强石膏'),
//        ),
//        509 => array(
//            //'墙面处理'
//            50901 => array('name' => '牛皮纸'),
//            50902 => array('name' => '网格布'),
//            50903 => array('name' => '网格带'),
//            50904 => array('name' => '美纹纸'),
//            50905 => array('name' => '贴墙白布'),
//        ),
//        510 => array(
//            //油工工具
//            51001 => array('name' => '刷子'),
//            51002 => array('name' => '滚筒'),
//            51003 => array('name' => '油工刀'),
//            51004 => array('name' => '油工抹子'),
//            51005 => array('name' => '伸缩把'),
//            51006 => array('name' => '砂布'),
//            51007 => array('name' => '小桶'),
//            51008 => array('name' => '砂纸架'),
//            51009 => array('name' => '油工排笔'),
//        ),
    );
    public static $Summary_Cate2_Ids = array(
        301, 302, 303, 304, 308, 401, 402, 403, 404, 501, 502, 508, 505, 507,
    );

    public static function getCate1Name(array $arr)
    {
        if (empty($arr))
        {
            return '';
        }
        $names = array();
        foreach ($arr as $cate1)
        {
            if (empty(self::$CATE1[$cate1]))
            {
                continue;
            }
            $names[] = self::$CATE1[$cate1]['name'];
        }

        return implode(',', $names);
    }

    public static function getCatesName($cate1, $cate2)
    {
        if (empty(self::$CATE1[$cate1]))
        {
            return '';
        }
        $name = self::$CATE1[$cate1]['name'];

        if (empty(self::$CATE2[$cate1][$cate2]))
        {
            return '';
        }
        $name .= '-';
        $name .= self::$CATE2[$cate1][$cate2]['name'];

        return $name;
    }

    public static function getSkuTypes()
    {
        return self::$SKY_TYPES;
    }

    private static $_sidNeedTocut = array(
        10169,10170,10676,10677,10980,11517,11532,11535,11572,11762,11784,11874,11881,11882,11883,11884,11885,11886,11887,11888,12581,12599,12954,12955,10980,11535,11762,11882,11886,11887,11885,11883,11881,11874,11572,10169,12599,12581,11888,11884,11784,11532,11517,10677,10676,10170,10236,10238,10239,10240,10242,10243,10244,10245,10246,10247,10248,10249,10250,10251,10252,10255,10256,10257,10258,10261,10262,10264,10265,10267,10268,10269,10270,10271,10272,10273,10274,10275,10276,10277,10278,10298,10299,10300,10710,10711,10869,10872,10889,10892,11102,11123,11175,11181,11204,11206,11312,11355,11399,11435,11448,11472,11473,11478,11514,11526,11528,11547,11665,11688,11691,11694,11706,11718,11754,11814,11820,11821,11849,11876,11896,11905,11914,11933,11936,11944,11945,11946,11956,11973,11976,11994,12010,12011,12012,12036,12046,12062,12103,12104,12105,12116,12141,12152,12167,12176,12182,12185,12186,12187,12191,12204,12207,12223,12230,12243,12307,12313,12319,12323,12324,12332,12348,12350,12365,12366,12409,12436,12438,12440,12442,12447,12448,12547,12552,12553,12554,12559,12571,12623,12791,12792,12794,12795,12796,12797,12800,12801,12802,12803,12889,10268,12967,13013,13014,13015,13077,12797,13309,10243,10244,13498,13563,13574,10277,10274,12011,12010,10273,10278,10276,10275,11181,10889,11175,10892,11526,11973,11665,12046,12036,11473,12152,11528,12243,12191,12141,12062,11547,12366,12365,12332,12012,11994,11876,11472,10249,11435,12547,11204,10252,10250,11933,10251,10711,10255,10256,10269,10268,10270,10271,10272,10872,11754,12350,12319,11399,10264,12307,11718,10243,11976,10238,10257,11514,10258,13498,13601,12105,11102,13606,13613,11896,13563,11936,10239,13574,13649,13658,12104,12103,13667,12182,10261,10262,10244,10267,11945,13769,13770,13771,13774,13906,13907,13914,13924,13923,13930,13933,13934,13937,13945,13947,13948,13951,12447,13980,13988,11688,14016,12186,12185,14039,14073,14075,14078,14079,14087,14109,14110,14111,14112,14113,14114,14115,14122,10243,10244,10245,10273,10274,10275,10276,10277,10278,10892,11175,11181,11526,11688,11976,12204,12230,12313,12409,13906,13933,13934,14128,14129,14130,14131,14352,14353,14354,14355,14356,14357,14358,14359,14360,14361,14362,14363,14364,14365,14366,14367,14368,14369,14370,14371,14372,14373,14374,14375,14376,14404,14421,14420,14405,14411,14426,14427,14428,14429,14430,14433,14432,14431,14419,14418,14417,14416,14415,14414,14413,14412,14410,14409,14408,14407,14406,14423,14422,14440,11820,14449,14450,14451,14466,14475,14474,12801,12800,14486,14487,14490,14491,14492,14493,14494,14495,14496,14497,14498,14499,14508,11905,14523,14563,14565,14566,14574,14579,14580,14595,14596,14597,14598,14599,14600,14601,14602,14646,14706,10935,11772,11901,12003,12126,12259,12314,10935,12003,11901,11772,12259,12314,13828,10935,11772,11901,12003,12259,12314,11504,11546,11726,11733,11848,11929,11726,11929,11546,11733,11504,11265,11651,12548,12548,11651,11265,
    );
    public static function getSidNeedToCut()
    {
        return self::$_sidNeedTocut;
    }

    //横向裁断sku
    private static $_sidNeedTocutHor = array(
        10236,10238,10239,10240,10249,10250,10251,10252,10255,10256,10257,10258,10261,10262,10710,10711,10869,11204,11206,11355,11399,11435,11448,11478,11514,11718,11814,11849,11896,11914,11933,11936,11944,11945,11946,11956,11976,12176,12207,12307,12313,12348,12436,12438,12440,12447,12448,12623,12791,12792,12794,12795,12796,12797,12889,13077,13498,13563,13601,13606,13613,13649,13658,13667,13907,13923,13924,13930,13937,13945,13947,13948,14016,14039,14073,14078,14087,14109,14110,14111,14112,14122,14128,14129,14130,14352,14353,14354,14355,14356,14357,14358,14359,14360,14361,14362,14363,14364,14373,14376,14404,14406,14407,14408,14409,14410,14411,14412,14413,14414,14415,14416,14422,14423,14451,14486,14487,14490,14491,14493,14496,14497,14498,14508,14563,14565,14566,14574,14580,14597,14646,14706
    );
    //竖向裁断sku
    private static $_sidNeedTocutVer = array(
        10242,10243,10244,10245,10246,10247,10248,10298,11312,11706,12116,13906,13951,13980,13988,14113,14114,14115,14365,14366,14367,14368,14369,14370,14371,14372,14405,14417,14418,14419,14420,14421,14426,14427,14428,14429,14430,14431,14432,14433,14492,14494,14495,14499
    );

    /**
     * 裁断类型：0不需要裁断；1横向；2竖向
     * @param $sid
     * @return int
     */
    public static function getSkuCutType($sid)
    {
        $type = 0;
        if (in_array($sid, self::$_sidNeedTocutHor))
        {
            $type = 1;
        }
        else if (in_array($sid, self::$_sidNeedTocutVer))
        {
            $type = 2;
        }

        return $type;
    }

    public static function getCate2List2Customer($cate1)
    {
        $cate2List = Tool_Array::sortByField(self::$CATE2[$cate1], 'sortby');
        return $cate2List;
    }
}
